In [1]:
#Q1

In [1]:
import pandas as pd
data = [4,8,15,16,23,42]
gg = pd.Series(data)
gg

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [5]:
type(gg)

pandas.core.series.Series

In [6]:
#Q2

In [8]:
list1 = [1,2,3,4,5,6,78,8,9,10]
gp = pd.Series(list1)
gp

0     1
1     2
2     3
3     4
4     5
5     6
6    78
7     8
8     9
9    10
dtype: int64

In [9]:
type(gp)

pandas.core.series.Series

In [10]:
#Q3

In [14]:
data = {'Name':['Alice','Bob','Claire'],'Age':[25,30,27],'Gender':['Female','Male','Female']}

In [17]:
pd.DataFrame(data)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [27]:
#Q4

In [18]:
"DataFrame - a DataFrame is a two-dimensional, size-mutable, and heterogeneous tabular data structure with labeled axes (rows and columns)."

'DataFrame - a DataFrame is a two-dimensional, size-mutable, and heterogeneous tabular data structure with labeled axes (rows and columns).'

In [20]:
df = pd.DataFrame(data)

In [22]:
df.columns

Index(['Name', 'Age', 'Gender'], dtype='object')

In [23]:
df['Name']

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

In [24]:
type(df['Name'])

pandas.core.series.Series

In [25]:
df[['Name', 'Age']]

     Name  Age
0   Alice   25
1     Bob   30
2  Claire   27

In [26]:
type(df[['Name', 'Age']])

pandas.core.frame.DataFrame

In [28]:
#Q5

In [3]:
"Some common functions you can use to manipulate data in a Pandas DataFrame are 1. Head() 2.Tail() 3. data_frame.columns 4. data_frame.dtypes etc"

'Some common functions you can use to manipulate data in a Pandas DataFrame are 1. Head() 2.Tail() 3. data_frame.columns 4. data_frame.dtypes etc'

In [7]:
titanic = pd.read_csv("titanic.csv")

In [8]:
titanic.head(4)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

In [9]:
titanic.tail(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [10]:
titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [11]:
titanic.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [12]:
titanic['Parch']

0      0
1      0
2      0
3      0
4      0
      ..
886    0
887    0
888    2
889    0
890    0
Name: Parch, Length: 891, dtype: int64

In [13]:
titanic[['Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']]

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 5 columns]

In [14]:
#Q6

In [15]:
"Series and DataFrames are mutable in nature, meaning you can modify their contents after creation as compared to Panels."

'Series and DataFrames are mutable in nature, meaning you can modify their contents after creation as compared to Panels.'

In [16]:
#Q7

In [25]:
names = pd.Series(['Alice', 'Bob', 'Charlie', 'David', 'Emily'])
ages = pd.Series([25, 30, 22, 28, 35])
cities = pd.Series(['New York', 'Los Angeles', 'Chicago', 'Houston', 'Miami'])
data = {'Name': names,'Age': ages,'City': cities}
pd.DataFrame(data)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   22      Chicago
3    David   28      Houston
4    Emily   35        Miami